# Exercise I

In [1]:
import pandas as pd
import numpy as np

In [2]:
from env import host, user, password

url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [3]:
employees = pd.read_sql('SELECT * FROM employees', url)
employees.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [4]:
#5.a.  Intentionally make a typo in the database url. What kind of error message do you see? -- removed the "s" from the "employees" table.

#(pymysql.err.OperationalError) (1044, "Access denied for user 'germain_1459'@'%' to database 'employee'")
#(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [5]:
#5.b. Intentionally make an error in your SQL query. What does the error message look like? -- removed the "s" from the "employees" table.

#(pymysql.err.ProgrammingError) (1146, "Table 'employees.employee' doesn't exist")
#[SQL: SELECT * FROM employee LIMIT 5 OFFSET 50]
#(Background on this error at: http://sqlalche.me/e/14/f405)

In [6]:
#6. Read the employees and titles tables into two separate DataFrame
titles = pd.read_sql('SELECT * FROM titles', url)
titles

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

In [7]:
#7. How many rows and columns do you have in each DataFrame? Is that what you expected?
titles.shape

(443308, 4)

In [8]:
employees.shape

(300024, 6)

In [9]:
#7. Is that what you expected?
#No. It only gives the shape of the displayed table not the entire table on the server.

In [10]:
#8. Display the summary statistics for each DataFrame.
titles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

In [11]:
titles.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [12]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      300024 non-null  int64
 1   birth_date  300024 non-null  object
 2   first_name  300024 non-null  object
 3   last_name   300024 non-null  object
 4   gender      300024 non-null  object
 5   hire_date   300024 non-null  object
dtypes: int64(1), object(5)
memory usage: 13.7+ MB

In [13]:
employees.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [14]:
titles.title.unique()
#You can use nunique() in place of unique().size ??

array(['Senior Engineer', 'Staff', 'Engineer', 'Senior Staff',
       'Assistant Engineer', 'Technique Leader', 'Manager'], dtype=object)

In [15]:
#9. How many unique titles are in the titles DataFrame
titles.title.value_counts()

Engineer              115003
Staff                 107391
Senior Engineer        97750
Senior Staff           92853
Technique Leader       15159
Assistant Engineer     15128
Manager                   24
Name: title, dtype: int64

In [16]:
len(titles.title.value_counts())

7

In [17]:
#10. What is the oldest date in the to_date column?
titles.sort_values('to_date')

        emp_no            title   from_date     to_date
16064    20869         Engineer  1985-02-17  1985-03-01
406358  474918         Engineer  1985-02-10  1985-03-11
346216  434232            Staff  1985-02-26  1985-03-20
35527    34059  Senior Engineer  1985-02-10  1985-03-23
277603  287732            Staff  1985-04-14  1985-04-17
...        ...              ...         ...         ...
191714  229523  Senior Engineer  1996-11-29  9999-01-01
191712  229522  Senior Engineer  2002-01-22  9999-01-01
191707  229520            Staff  1999-09-07  9999-01-01
191723  229529  Senior Engineer  1997-04-05  9999-01-01
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

In [18]:
#11. What is the most recent date in the to_date column?
titles.sort_values('to_date').tail()

        emp_no            title   from_date     to_date
191714  229523  Senior Engineer  1996-11-29  9999-01-01
191712  229522  Senior Engineer  2002-01-22  9999-01-01
191707  229520            Staff  1999-09-07  9999-01-01
191723  229529  Senior Engineer  1997-04-05  9999-01-01
443307  499999         Engineer  1997-11-30  9999-01-01

# Exercise II

In [19]:
#1. Copy the users and roles DataFrames from the examples above.
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [20]:
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [21]:
#2. What is the result of using a right join on the DataFrames?
users.merge(roles, how='right')

   id       name  role_id
0   1      admin      NaN
1   2     author      NaN
2   3   reviewer      NaN
3   4  commenter      NaN

In [22]:
#3. What is the result of using an outer join on the DataFrames?
users.merge(roles, how='outer', left_on ='role_id', right_on='id')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

In [23]:
#4. What happens if you drop the foreign keys from the DataFrames and try to merge them?
#x = users.drop(columns=['role_id'])
#x

In [24]:
#x.merge(roles, how='outer')

In [25]:
users.drop(columns=['role_id']).merge(roles, how='outer', on='id')

   id name_x     name_y
0   1    bob      admin
1   2    joe     author
2   3  sally   reviewer
3   4   adam  commenter
4   5   jane        NaN
5   6   mike        NaN

In [26]:
#5. Load the mpg dataset from PyDataset.
from pydataset import data #imports "data" from "pydataset"
mpg = data('mpg') #loads "mpg" from the "data" variable and assignd as "mpg" variable
mpg = pd.DataFrame(mpg)

In [27]:
#6. Output and read the documentation for the mpg dataset
data('mpg',show_doc = True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

In [28]:
#7. How many rows and columns are in the dataset?
mpg.shape

(234, 11)

In [29]:
#8. Check out your column names and perform any cleanup you may want on them.
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [30]:
mpg = mpg.rename(columns={'cty': 'city', 'hwy': 'highway', 'class': 'type'})
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,type
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact

In [31]:
#9. Display the summary statistics for the dataset.
mpg.describe()

            displ         year         cyl        city     highway
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

In [32]:
mpg.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 234 entries, 1 to 234
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   displ         234 non-null    float64
 3   year          234 non-null    int64
 4   cyl           234 non-null    int64
 5   trans         234 non-null    object
 6   drv           234 non-null    object
 7   city          234 non-null    int64
 8   highway       234 non-null    int64
 9   fl            234 non-null    object
 10  type          234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 21.9+ KB

In [33]:
#10. How many different manufacturers are there?
mpg.value_counts('manufacturer')

manufacturer
dodge         37
toyota        34
volkswagen    27
ford          25
chevrolet     19
audi          18
hyundai       14
subaru        14
nissan        13
honda          9
jeep           8
pontiac        5
land rover     4
mercury        4
lincoln        3
dtype: int64

In [34]:
#11. How many different models are there?
mpg.value_counts('model')

model
caravan 2wd               11
ram 1500 pickup 4wd       10
civic                      9
jetta                      9
mustang                    9
dakota pickup 4wd          9
impreza awd                8
grand cherokee 4wd         8
a4 quattro                 8
camry solara               7
a4                         7
passat                     7
camry                      7
durango 4wd                7
sonata                     7
tiburon                    7
f150 pickup 4wd            7
toyota tacoma 4wd          7
new beetle                 6
4runner 4wd                6
forester awd               6
explorer 4wd               6
altima                     6
gti                        5
c1500 suburban 2wd         5
corolla                    5
corvette                   5
grand prix                 5
malibu                     5
mountaineer 4wd            4
pathfinder 4wd             4
range rover                4
k1500 tahoe 4wd            4
expedition 2wd             3
maxima                     3
a6 quattro                 3
navigator 2wd              3
land cruiser wagon 4wd     2
dtype: int64

In [35]:
#11. How many different models are there?
mpg.model.nunique()

38

In [36]:
#12. Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.
mpg = mpg.assign(mileage_difference = mpg.highway - mpg.city)
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,type,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10

In [37]:
#13. Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.
mpg = mpg.assign(average_mileage=mpg.loc[:, ['city', 'highway']].mean(axis=1))
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,type,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0

In [38]:
#14. Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.
bools = mpg.trans.str.startswith('a')
bools

1       True
2      False
3      False
4       True
5       True
       ...
230     True
231    False
232     True
233    False
234     True
Name: trans, Length: 234, dtype: bool

In [39]:
mpg['is_auto'] = np.where(bools == True, 'auto', 'manual')
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,type,mileage_difference,average_mileage,is_auto
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,auto
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,manual
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,manual
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,auto
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,auto

In [40]:
#15. Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?
mpg.groupby('manufacturer').average_mileage.max().tail(1)

manufacturer
volkswagen    39.5
Name: average_mileage, dtype: float64

In [41]:
#16. Do automatic or manual cars have better miles per gallon?
mpg.groupby('is_auto').average_mileage.max()

is_auto
auto      35.0
manual    39.5
Name: average_mileage, dtype: float64

# Exercise III

In [42]:
#1. Use your get_db_url function to help you explore the data from the chipotle database.
from env import host, user, password

url = f'mysql+pymysql://{user}:{password}@{host}/chipotle'

In [43]:
menu = pd.read_sql('SELECT * FROM orders', url)
menu.head(20)

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98
5,6,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sour Cream, Guacamole, Lettuce]]",$10.98
6,7,3,1,Side of Chips,nan,$1.69
7,8,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables, Black Beans, Pinto Beans, Cheese, Sour...",$11.75
8,9,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Cheese, Sour Cream, Lettuce]]",$9.25
9,10,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto Beans, Cheese, Sour Cream, Lettuce]]",$9.25
10,11,5,1,Chips and Guacamole,nan,$4.45
11,12,6,1,Chicken Crispy Tacos,"[Roasted Chili Corn Salsa, [Fajita Vegetables, Rice, Black Beans, Cheese, Sour Cream]]",$8.75
12,13,6,1,Chicken Soft Tacos,"[Roasted Chili Corn Salsa, [Rice, Black Beans, Cheese, Sour Cream]]",$8.75
13,14,7,1,Chicken Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice, Cheese, Sour Cream, Guacamole]]",$11.25
14,15,7,1,Chips and Guacamole,nan,$4.45
15,16,8,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
16,17,8,1,Chicken Burrito,"[Tomatillo-Green Chili Salsa (Medium), [Pinto Beans, Cheese, Sour Cream]]",$8.49
17,18,9,1,Chicken Burrito,"[Fresh Tomato Salsa (Mild), [Black Beans, Rice, Cheese, Sour Cream, Lettuce]]",$8.49
18,19,9,2,Canned Soda,[Sprite],$2.18
19,20,10,1,Chicken Bowl,"[Tomatillo Red Chili Salsa, [Fajita Vegetables, Black Beans, Sour Cream, Cheese, Lettu...",$8.75

In [44]:
menu.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   id                  4622 non-null   int64
 1   order_id            4622 non-null   int64
 2   quantity            4622 non-null   int64
 3   item_name           4622 non-null   object
 4   choice_description  4622 non-null   object
 5   item_price          4622 non-null   object
dtypes: int64(3), object(3)
memory usage: 216.8+ KB

In [51]:
#2. What is the total price for each order?
menu['item_price'] = menu.item_price.apply(lambda value: float(value[1: ].strip()))

TypeError: 'float' object is not subscriptable

In [49]:
menu.head(2)# I get the above error; however the "item_price" shows the '$' has been removed.

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,2.39
1,2,1,1,Izze,[Clementine],3.39

In [52]:
menu.info()#with the above error, "item_price" is listed as a "float"

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   id                  4622 non-null   int64
 1   order_id            4622 non-null   int64
 2   quantity            4622 non-null   int64
 3   item_name           4622 non-null   object
 4   choice_description  4622 non-null   object
 5   item_price          4622 non-null   float64
dtypes: float64(1), int64(3), object(2)
memory usage: 216.8+ KB

In [53]:
#now that the "$" has been removed from "item_price" and its been converted to a float fins the total for each order_id
menu.groupby('order_id').item_price.agg('sum')#group by the order_id and sum the item prices

order_id
1       11.56
2       16.98
3       12.67
4       21.00
5       13.70
        ...
1830    23.00
1831    12.90
1832    13.20
1833    23.50
1834    28.75
Name: item_price, Length: 1834, dtype: float64

In [58]:
#3. What are the most popular 3 items?
#Here we group by the item name and sum the quantities.
#then sort_values
menu.groupby('item_name').quantity.agg('sum').sort_values(ascending = True).tail(3)#Because I used TRUE in ascending order I took the tail (last three).

item_name
Chips and Guacamole    506
Chicken Burrito        591
Chicken Bowl           761
Name: quantity, dtype: int64

In [61]:
#4. Which item has produced the most revenue?
#here we do the same except we aggregate the sum of item_price.
menu.groupby('item_name').item_price.agg('sum').sort_values(ascending = True).tail(1)

item_name
Chicken Bowl    7342.73
Name: item_price, dtype: float64

In [64]:
#5. Join the employees and titles DataFrames together.
title = employees.merge(titles, how='outer', left_on='emp_no', right_on='emp_no')
title

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01
...,...,...,...,...,...,...,...,...,...
443303,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Engineer,1987-08-30,1992-08-29
443304,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Senior Engineer,1992-08-29,9999-01-01
443305,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Senior Staff,1998-12-27,9999-01-01
443306,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Staff,1993-12-27,1998-12-27
443307,499999,1958-05-01,Sachin,Tsukuda,M,1997-11-30,Engineer,1997-11-30,9999-01-01

In [68]:
#6. For each title, find the hire date of the employee that was hired most recently with that title.
title.groupby('title').from_date.max()

title
Assistant Engineer    2000-02-01
Engineer              2002-08-01
Manager               1996-08-30
Senior Engineer       2002-08-01
Senior Staff          2002-08-01
Staff                 2000-02-01
Technique Leader      2000-02-01
Name: from_date, dtype: object

In [72]:
url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [79]:
#7. Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)
titles_by_department = pd.read_sql('SELECT title as titles, departments.dept_name as department FROM titles JOIN dept_emp USING(emp_no) JOIN departments USING(dept_no);', url)
titles_by_department.head(20)
#Ran querry in Sequel ACE first and copied it over.

             titles        department
0             Staff  Customer Service
1      Senior Staff  Customer Service
2             Staff  Customer Service
3      Senior Staff  Customer Service
4             Staff  Customer Service
5      Senior Staff  Customer Service
6             Staff  Customer Service
7      Senior Staff  Customer Service
8             Staff  Customer Service
9          Engineer  Customer Service
10  Senior Engineer  Customer Service
11            Staff  Customer Service
12            Staff  Customer Service
13     Senior Staff  Customer Service
14            Staff  Customer Service
15     Senior Staff  Customer Service
16            Staff  Customer Service
17     Senior Staff  Customer Service
18            Staff  Customer Service
19            Staff  Customer Service

In [80]:
pd.crosstab(titles_by_department.department, titles_by_department.titles)

titles,Assistant Engineer,Engineer,Manager,Senior Engineer,Senior Staff,Staff,Technique Leader
department,,,,,,,
Customer Service,298,2362,4,2027,13925,16150,309
Development,7769,58135,2,49326,1247,1424,7683
Finance,0,0,2,0,12139,13929,0
Human Resources,0,0,2,0,12274,14342,0
Marketing,0,0,2,0,13940,16196,0
Production,6445,49649,4,42205,1270,1478,6557
Quality Management,1831,13852,4,11864,0,0,1795
Research,378,2986,2,2570,11637,13495,393
Sales,0,0,2,0,36191,41808,0